#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.ca-central-1.module.rotate_key.data.archive_file.fn: Refreshing state...
module.ca-central-1.module.auth_session.module.fn.data.archive_file.fn: Refreshing state...
module.us-east-2.module.auth_session.module.fn.data.archive_file.fn: Refreshing state...
module.us-west-2.module.auth_session.module.fn.data.archive_file.fn: Refreshing state...
module.us-east-2.module.rotate_key.data.archive_file.fn: Refreshing state...
module.us-west-2.module.rotate_key.data.archive_file.fn: Refreshing state...
module.ca-central-1.data.aws_region.current: Refreshing state...
module.ca-central-1.aws_cloudwatch_event_rule.rotate_key: Refreshing state... [id=Profile-RotateKey20200730165030707500000001]
module.ca-central-1.module.rotate_key.aws_cloudwatch_log_group.fn: Refreshing state... [id=/aws/lambda/Profile-RotateKey]
module.ca-central-1.aws_apigatewayv2_api.api: Refreshing state... [id=jws7wmtlhe]
module.ca-central-1.module.auth_session.module.fn.aws_cloudwatch_log_group.fn: Refreshing state... [id=/aws/lambda/Profile-AuthSessionCreate]
module.us-east-2.module.rotate_key.aws_cloudwatch_log_group.fn: Refreshing state... [id=/aws/lambda/Profile-RotateKey]
module.us-east-2.aws_cloudwatch_event_rule.rotate_key: Refreshing state... [id=Profile-RotateKey20200730165029922900000001]
module.us-east-2.aws_apigatewayv2_api.api: Refreshing state... [id=kqd50msd8k]
module.us-east-2.module.auth_session.module.fn.aws_cloudwatch_log_group.fn: Refreshing state... [id=/aws/lambda/Profile-AuthSessionCreate]
module.us-east-2.data.aws_region.current: Refreshing state...
data.aws_iam_role.apigw_logs: Refreshing state...
data.aws_route53_zone.domain: Refreshing state...
aws_dynamodb_table.table: Refreshing state... [id=Profile]
data.aws_iam_policy_document.rotate_key: Refreshing state...
data.aws_iam_policy_document.lambda_assume: Refreshing state...
module.us-west-2.module.rotate_key.aws_cloudwatch_log_group.fn: Refreshing state... [id=/aws/lambda/Profile-RotateKey]
module.us-west-2.aws_cloudwatch_event_rule.rotate_key: Refreshing state... [id=Profile-RotateKey20200730165028780300000001]
module.us-west-2.aws_apigatewayv2_api.api: Refreshing state... [id=gg9vmg5f7g]
module.us-west-2.data.aws_region.current: Refreshing state...
module.ca-central-1.aws_apigatewayv2_authorizer.webid: Refreshing state... [id=1pmsxk]
module.ca-central-1.aws_cloudwatch_log_group.api_access_logs: Refreshing state... [id=/aws/apigw/Profile]
module.us-east-2.aws_cloudwatch_log_group.api_access_logs: Refreshing state... [id=/aws/apigw/Profile]
module.us-east-2.aws_apigatewayv2_authorizer.webid: Refreshing state... [id=bx71bx]
aws_iam_role.jwks: Refreshing state... [id=ProfileLambdaJWKSRole]
aws_iam_role.lambda_dynamo: Refreshing state... [id=ProfileLambdaDynamoRole]
aws_route53_zone.api: Refreshing state... [id=Z1025684OODEJ1S5I8C4]
data.aws_iam_policy_document.dynamo_rw: Refreshing state...
module.us-west-2.aws_cloudwatch_log_group.api_access_logs: Refreshing state... [id=/aws/apigw/Profile]
module.us-west-2.aws_apigatewayv2_authorizer.webid: Refreshing state... [id=3rfg0r]
module.us-east-2.aws_api_gateway_account.logging: Refreshing state... [id=api-gateway-account]
aws_iam_role_policy.rotate_key: Refreshing state... [id=ProfileLambdaJWKSRole:RotateKey]
aws_iam_role_policy_attachment.lambda_dynamo_basic: Refreshing state... [id=ProfileLambdaDynamoRole-20200716174939791100000002]
module.us-west-2.aws_api_gateway_account.logging: Refreshing state... [id=api-gateway-account]
module.ca-central-1.aws_api_gateway_account.logging: Refreshing state... [id=api-gateway-account]
module.us-east-2.data.aws_dynamodb_table.table: Refreshing state...
module.ca-central-1.data.aws_dynamodb_table.table: Refreshing state...
module.us-west-2.data.aws_dynamodb_table.table: Refreshing state...
aws_iam_policy.dynamo_rw: Refreshing state... [id=arn:aws:iam::760208797553:policy/ProfileDynamoDBReadWrite]
module.us-east-2.aws_apigatewayv2_stage.deploy: Refreshing state... [id=deploy]
module.ca-central-1.aws_apigatewayv2_stage.deploy: Refreshing state... [id=deploy]
aws_route53_record.api_ns: Refreshing state... [id=Z09040433PDMRFH5IC379_api.gossett.io._NS]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-1:760208797553:certificate/cd2ea6f3-f39e-418a-be8d-9ad3ea25be18]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=ProfileLambdaDynamoRole-20200716175252247000000003]
module.us-east-2.data.aws_route53_zone.api: Refreshing state...
aws_iam_role_policy_attachment.jwks_dynamo: Refreshing state... [id=ProfileLambdaJWKSRole-20200730165031437900000001]
module.us-west-2.data.aws_route53_zone.api: Refreshing state...
module.ca-central-1.data.aws_route53_zone.api: Refreshing state...
module.us-west-2.aws_apigatewayv2_stage.deploy: Refreshing state... [id=deploy]
aws_route53_record.cert_validation: Refreshing state... [id=Z1025684OODEJ1S5I8C4__dbdf6f64c060dce7a4ade975faaa2932.api.gossett.io._CNAME]
module.us-east-2.module.rotate_key.aws_lambda_function.fn: Refreshing state... [id=Profile-RotateKey]
module.us-east-2.module.auth_session.module.fn.aws_lambda_function.fn: Refreshing state... [id=Profile-AuthSessionCreate]
aws_acm_certificate_validation.api: Refreshing state... [id=2020-07-16 17:55:05 +0000 UTC]
module.us-west-2.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-west-2:760208797553:certificate/cb814f4f-b668-460b-bdd3-5a63ed534186]
module.us-west-2.aws_acm_certificate.regional: Refreshing state... [id=arn:aws:acm:us-west-2:760208797553:certificate/9b472ae1-aed9-40a6-88dd-cab68bcfdd69]
module.ca-central-1.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:ca-central-1:760208797553:certificate/9a965385-cc5e-4f69-a892-5b25c90d5978]
module.ca-central-1.aws_acm_certificate.regional: Refreshing state... [id=arn:aws:acm:ca-central-1:760208797553:certificate/5aa19a91-18ba-46d7-883f-862f772ad82e]
module.us-east-2.aws_cloudwatch_event_target.rotate_key: Refreshing state... [id=Profile-RotateKey20200730165029922900000001-Profile-RotateKey]
module.us-east-2.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.us-east-2.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-2:760208797553:certificate/08f8c046-e6c4-4d3a-aad2-1939182591b1]
module.us-east-2.module.auth_session.aws_lambda_permission.fn: Refreshing state... [id=AllowAPIInvoke]
module.us-east-2.module.auth_session.aws_apigatewayv2_integration.fn: Refreshing state... [id=un1vwrt]
module.us-east-2.aws_acm_certificate.regional: Refreshing state... [id=arn:aws:acm:us-east-2:760208797553:certificate/fbaa67cb-b5f5-4a8e-85eb-becdb20b5786]
module.us-east-2.module.auth_session.aws_apigatewayv2_route.fn: Refreshing state... [id=wouiyo4]
module.ca-central-1.module.rotate_key.aws_lambda_function.fn: Refreshing state... [id=Profile-RotateKey]
module.ca-central-1.module.auth_session.module.fn.aws_lambda_function.fn: Refreshing state... [id=Profile-AuthSessionCreate]
module.us-east-2.aws_acm_certificate_validation.api: Refreshing state... [id=2020-07-16 17:52:34 +0000 UTC]
module.ca-central-1.aws_route53_record.regional_cert_validation: Refreshing state... [id=Z1025684OODEJ1S5I8C4__0cb9049da28e9c94165c7ecc115f94a6.ca-central-1.api.gossett.io._CNAME]
module.ca-central-1.aws_acm_certificate_validation.api: Refreshing state... [id=2020-07-16 17:52:37 +0000 UTC]
module.us-east-2.aws_route53_record.regional_cert_validation: Refreshing state... [id=Z1025684OODEJ1S5I8C4__ae3b2a47006a7ad6df3d9aabbd0986bc.us-east-2.api.gossett.io._CNAME]
module.ca-central-1.aws_cloudwatch_event_target.rotate_key: Refreshing state... [id=Profile-RotateKey20200730165030707500000001-Profile-RotateKey]
module.us-east-2.aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.gossett.io]
module.ca-central-1.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.ca-central-1.module.auth_session.aws_apigatewayv2_integration.fn: Refreshing state... [id=wvj9808]
module.ca-central-1.module.auth_session.aws_lambda_permission.fn: Refreshing state... [id=AllowAPIInvoke]
module.ca-central-1.aws_acm_certificate_validation.regional: Refreshing state... [id=2020-07-16 17:51:04 +0000 UTC]
module.ca-central-1.aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.gossett.io]
module.us-east-2.aws_acm_certificate_validation.regional: Refreshing state... [id=2020-07-16 17:53:32 +0000 UTC]
module.us-west-2.aws_route53_record.regional_cert_validation: Refreshing state... [id=Z1025684OODEJ1S5I8C4__9868839cc5d8a4404fc1d31c98f129d4.us-west-2.api.gossett.io._CNAME]
module.us-east-2.aws_route53_record.api: Refreshing state... [id=Z1025684OODEJ1S5I8C4_api.gossett.io_A_api.gossett.io._us-east-2]
module.us-east-2.aws_apigatewayv2_api_mapping.base: Refreshing state... [id=u1f9id]
module.us-west-2.aws_acm_certificate_validation.api: Refreshing state... [id=2020-07-16 17:53:30 +0000 UTC]
module.ca-central-1.module.auth_session.aws_apigatewayv2_route.fn: Refreshing state... [id=ybmqzjh]
module.ca-central-1.aws_apigatewayv2_domain_name.regional: Refreshing state... [id=ca-central-1.api.gossett.io]
module.us-east-2.aws_apigatewayv2_domain_name.regional: Refreshing state... [id=us-east-2.api.gossett.io]
module.ca-central-1.aws_route53_record.api: Refreshing state... [id=Z1025684OODEJ1S5I8C4_api.gossett.io_A_api.gossett.io._ca-central-1]
module.ca-central-1.aws_apigatewayv2_api_mapping.base: Refreshing state... [id=kbvzeu]
module.us-west-2.aws_acm_certificate_validation.regional: Refreshing state... [id=2020-07-16 17:51:32 +0000 UTC]
module.us-east-2.aws_apigatewayv2_api_mapping.regional: Refreshing state... [id=dr2mes]
module.us-east-2.aws_route53_record.regional: Refreshing state... [id=Z1025684OODEJ1S5I8C4_us-east-2.api.gossett.io_A]
module.ca-central-1.aws_route53_record.regional: Refreshing state... [id=Z1025684OODEJ1S5I8C4_ca-central-1.api.gossett.io_A]
module.ca-central-1.aws_apigatewayv2_api_mapping.regional: Refreshing state... [id=swnetv]
module.us-west-2.module.auth_session.module.fn.aws_lambda_function.fn: Refreshing state... [id=Profile-AuthSessionCreate]
module.us-west-2.module.rotate_key.aws_lambda_function.fn: Refreshing state... [id=Profile-RotateKey]
module.us-west-2.aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.gossett.io]
module.us-west-2.aws_apigatewayv2_domain_name.regional: Refreshing state... [id=us-west-2.api.gossett.io]
module.us-west-2.aws_apigatewayv2_api_mapping.base: Refreshing state... [id=c7wahi]
module.us-west-2.aws_route53_record.api: Refreshing state... [id=Z1025684OODEJ1S5I8C4_api.gossett.io_A_api.gossett.io._us-west-2]
module.us-west-2.aws_apigatewayv2_api_mapping.regional: Refreshing state... [id=6ok0l3]
module.us-west-2.aws_route53_record.regional: Refreshing state... [id=Z1025684OODEJ1S5I8C4_us-west-2.api.gossett.io_A]
module.us-west-2.module.auth_session.aws_lambda_permission.fn: Refreshing state... [id=AllowAPIInvoke]
module.us-west-2.module.auth_session.aws_apigatewayv2_integration.fn: Refreshing state... [id=45jtbo7]
module.us-west-2.aws_cloudwatch_event_target.rotate_key: Refreshing state... [id=Profile-RotateKey20200730165028780300000001-Profile-RotateKey]
module.us-west-2.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.us-west-2.module.auth_session.aws_apigatewayv2_route.fn: Refreshing state... [id=45d14ob]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ca-central-1.aws_apigatewayv2_stage.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "deploy" {
        api_id          = "jws7wmtlhe"
        arn             = "arn:aws:apigateway:ca-central-1::/apis/jws7wmtlhe/stages/deploy"
        auto_deploy     = true
      - deployment_id   = "viankg" -> null
        id              = "deploy"
        invoke_url      = "https://jws7wmtlhe.execute-api.ca-central-1.amazonaws.com/deploy"
        name            = "deploy"
        stage_variables = {}
        tags            = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }

        access_log_settings {
            destination_arn = "arn:aws:logs:ca-central-1:760208797553:log-group:/aws/apigw/Profile"
            format          = jsonencode(
                {
                    httpMethod         = "$context.httpMethod"
                    integrationLatency = "$context.integrationLatency"
                    ip                 = "$context.identity.sourceIp"
                    protocol           = "$context.protocol"
                    requestId          = "$context.requestId"
                    requestTime        = "$context.requestTime"
                    responseLatency    = "$context.responseLatency"
                    responseLength     = "$context.responseLength"
                    routeKey           = "$context.routeKey"
                    status             = "$context.status"
                }
            )
        }

        default_route_settings {
            data_trace_enabled       = false
            detailed_metrics_enabled = false
            throttling_burst_limit   = 0
            throttling_rate_limit    = 0
        }
    }

  # module.us-east-2.aws_apigatewayv2_stage.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "deploy" {
        api_id          = "kqd50msd8k"
        arn             = "arn:aws:apigateway:us-east-2::/apis/kqd50msd8k/stages/deploy"
        auto_deploy     = true
      - deployment_id   = "2rct4n" -> null
        id              = "deploy"
        invoke_url      = "https://kqd50msd8k.execute-api.us-east-2.amazonaws.com/deploy"
        name            = "deploy"
        stage_variables = {}
        tags            = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }

        access_log_settings {
            destination_arn = "arn:aws:logs:us-east-2:760208797553:log-group:/aws/apigw/Profile"
            format          = jsonencode(
                {
                    httpMethod         = "$context.httpMethod"
                    integrationLatency = "$context.integrationLatency"
                    ip                 = "$context.identity.sourceIp"
                    protocol           = "$context.protocol"
                    requestId          = "$context.requestId"
                    requestTime        = "$context.requestTime"
                    responseLatency    = "$context.responseLatency"
                    responseLength     = "$context.responseLength"
                    routeKey           = "$context.routeKey"
                    status             = "$context.status"
                }
            )
        }

        default_route_settings {
            data_trace_enabled       = false
            detailed_metrics_enabled = false
            throttling_burst_limit   = 0
            throttling_rate_limit    = 0
        }
    }

  # module.us-west-2.aws_apigatewayv2_stage.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "deploy" {
        api_id          = "gg9vmg5f7g"
        arn             = "arn:aws:apigateway:us-west-2::/apis/gg9vmg5f7g/stages/deploy"
        auto_deploy     = true
      - deployment_id   = "ze1my7" -> null
        id              = "deploy"
        invoke_url      = "https://gg9vmg5f7g.execute-api.us-west-2.amazonaws.com/deploy"
        name            = "deploy"
        stage_variables = {}
        tags            = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }

        access_log_settings {
            destination_arn = "arn:aws:logs:us-west-2:760208797553:log-group:/aws/apigw/Profile"
            format          = jsonencode(
                {
                    httpMethod         = "$context.httpMethod"
                    integrationLatency = "$context.integrationLatency"
                    ip                 = "$context.identity.sourceIp"
                    protocol           = "$context.protocol"
                    requestId          = "$context.requestId"
                    requestTime        = "$context.requestTime"
                    responseLatency    = "$context.responseLatency"
                    responseLength     = "$context.responseLength"
                    routeKey           = "$context.routeKey"
                    status             = "$context.status"
                }
            )
        }

        default_route_settings {
            data_trace_enabled       = false
            detailed_metrics_enabled = false
            throttling_burst_limit   = 0
            throttling_rate_limit    = 0
        }
    }

  # module.ca-central-1.module.auth_session.aws_lambda_permission.fn will be created
  + resource "aws_lambda_permission" "fn" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Profile-AuthSessionCreate"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:ca-central-1:760208797553:jws7wmtlhe/*/*/*"
      + statement_id  = "AllowAPIInvoke"
    }

  # module.ca-central-1.module.rotate_key.aws_lambda_function.fn will be updated in-place
  ~ resource "aws_lambda_function" "fn" {
        arn                            = "arn:aws:lambda:ca-central-1:760208797553:function:Profile-RotateKey"
        filename                       = "./../dist/rotate_key.zip"
        function_name                  = "Profile-RotateKey"
        handler                        = "rotate_key"
        id                             = "Profile-RotateKey"
        invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:760208797553:function:Profile-RotateKey/invocations"
      ~ last_modified                  = "2020-07-30T16:50:51.543+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ca-central-1:760208797553:function:Profile-RotateKey:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::760208797553:role/ProfileLambdaJWKSRole"
        runtime                        = "go1.x"
      ~ source_code_hash               = "SeijpsFPbCWOg3cxRd756F/xAy7lCzx1Os8zG773/Kg=" -> "4o49ReE6HUaxVp/Bs3xOThQJJT7HSZBkLB9enDMeG4s="
        source_code_size               = 7689305
        tags                           = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "DYNAMODB_TABLE" = "Profile"
                "KMS_ALIAS"      = "alias/profile/jwt"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.us-east-2.module.auth_session.aws_lambda_permission.fn will be created
  + resource "aws_lambda_permission" "fn" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Profile-AuthSessionCreate"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-2:760208797553:kqd50msd8k/*/*/*"
      + statement_id  = "AllowAPIInvoke"
    }

  # module.us-east-2.module.rotate_key.aws_lambda_function.fn will be updated in-place
  ~ resource "aws_lambda_function" "fn" {
        arn                            = "arn:aws:lambda:us-east-2:760208797553:function:Profile-RotateKey"
        filename                       = "./../dist/rotate_key.zip"
        function_name                  = "Profile-RotateKey"
        handler                        = "rotate_key"
        id                             = "Profile-RotateKey"
        invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:760208797553:function:Profile-RotateKey/invocations"
      ~ last_modified                  = "2020-07-30T16:50:47.125+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-2:760208797553:function:Profile-RotateKey:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::760208797553:role/ProfileLambdaJWKSRole"
        runtime                        = "go1.x"
      ~ source_code_hash               = "SeijpsFPbCWOg3cxRd756F/xAy7lCzx1Os8zG773/Kg=" -> "4o49ReE6HUaxVp/Bs3xOThQJJT7HSZBkLB9enDMeG4s="
        source_code_size               = 7689305
        tags                           = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "DYNAMODB_TABLE" = "Profile"
                "KMS_ALIAS"      = "alias/profile/jwt"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.us-west-2.module.auth_session.aws_lambda_permission.fn will be created
  + resource "aws_lambda_permission" "fn" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Profile-AuthSessionCreate"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-west-2:760208797553:gg9vmg5f7g/*/*/*"
      + statement_id  = "AllowAPIInvoke"
    }

  # module.us-west-2.module.rotate_key.aws_lambda_function.fn will be updated in-place
  ~ resource "aws_lambda_function" "fn" {
        arn                            = "arn:aws:lambda:us-west-2:760208797553:function:Profile-RotateKey"
        filename                       = "./../dist/rotate_key.zip"
        function_name                  = "Profile-RotateKey"
        handler                        = "rotate_key"
        id                             = "Profile-RotateKey"
        invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:760208797553:function:Profile-RotateKey/invocations"
      ~ last_modified                  = "2020-07-30T16:50:47.579+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-west-2:760208797553:function:Profile-RotateKey:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::760208797553:role/ProfileLambdaJWKSRole"
        runtime                        = "go1.x"
      ~ source_code_hash               = "SeijpsFPbCWOg3cxRd756F/xAy7lCzx1Os8zG773/Kg=" -> "4o49ReE6HUaxVp/Bs3xOThQJJT7HSZBkLB9enDMeG4s="
        source_code_size               = 7689305
        tags                           = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "DYNAMODB_TABLE" = "Profile"
                "KMS_ALIAS"      = "alias/profile/jwt"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.ca-central-1.module.auth_session.module.fn.aws_lambda_function.fn will be updated in-place
  ~ resource "aws_lambda_function" "fn" {
        arn                            = "arn:aws:lambda:ca-central-1:760208797553:function:Profile-AuthSessionCreate"
        filename                       = "./../dist/auth_session.zip"
        function_name                  = "Profile-AuthSessionCreate"
        handler                        = "auth_session"
        id                             = "Profile-AuthSessionCreate"
        invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:760208797553:function:Profile-AuthSessionCreate/invocations"
      ~ last_modified                  = "2020-07-30T16:50:52.576+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ca-central-1:760208797553:function:Profile-AuthSessionCreate:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::760208797553:role/ProfileLambdaDynamoRole"
        runtime                        = "go1.x"
      ~ source_code_hash               = "LdDfbxuJVuKxbwqzj8cEmVuCPpQpBvPYT2kMYqXscGc=" -> "KkZmEMtZKx47M8trgMZQsZReU1af2AwHqaGK9inChx4="
        source_code_size               = 7503887
        tags                           = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "DYNAMODB_TABLE" = "Profile"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.us-east-2.module.auth_session.module.fn.aws_lambda_function.fn will be updated in-place
  ~ resource "aws_lambda_function" "fn" {
        arn                            = "arn:aws:lambda:us-east-2:760208797553:function:Profile-AuthSessionCreate"
        filename                       = "./../dist/auth_session.zip"
        function_name                  = "Profile-AuthSessionCreate"
        handler                        = "auth_session"
        id                             = "Profile-AuthSessionCreate"
        invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:760208797553:function:Profile-AuthSessionCreate/invocations"
      ~ last_modified                  = "2020-07-30T16:50:48.213+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-2:760208797553:function:Profile-AuthSessionCreate:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::760208797553:role/ProfileLambdaDynamoRole"
        runtime                        = "go1.x"
      ~ source_code_hash               = "LdDfbxuJVuKxbwqzj8cEmVuCPpQpBvPYT2kMYqXscGc=" -> "KkZmEMtZKx47M8trgMZQsZReU1af2AwHqaGK9inChx4="
        source_code_size               = 7503887
        tags                           = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "DYNAMODB_TABLE" = "Profile"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.us-west-2.module.auth_session.module.fn.aws_cloudwatch_log_group.fn will be created
  + resource "aws_cloudwatch_log_group" "fn" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/Profile-AuthSessionCreate"
      + retention_in_days = 14
      + tags              = {
          + "IaC"     = "terraform"
          + "Project" = "Profile"
        }
    }

  # module.us-west-2.module.auth_session.module.fn.aws_lambda_function.fn will be updated in-place
  ~ resource "aws_lambda_function" "fn" {
        arn                            = "arn:aws:lambda:us-west-2:760208797553:function:Profile-AuthSessionCreate"
        filename                       = "./../dist/auth_session.zip"
        function_name                  = "Profile-AuthSessionCreate"
        handler                        = "auth_session"
        id                             = "Profile-AuthSessionCreate"
        invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:760208797553:function:Profile-AuthSessionCreate/invocations"
      ~ last_modified                  = "2020-07-30T16:50:48.221+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-west-2:760208797553:function:Profile-AuthSessionCreate:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::760208797553:role/ProfileLambdaDynamoRole"
        runtime                        = "go1.x"
      ~ source_code_hash               = "LdDfbxuJVuKxbwqzj8cEmVuCPpQpBvPYT2kMYqXscGc=" -> "KkZmEMtZKx47M8trgMZQsZReU1af2AwHqaGK9inChx4="
        source_code_size               = 7503887
        tags                           = {
            "IaC"     = "terraform"
            "Project" = "Profile"
        }
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "DYNAMODB_TABLE" = "Profile"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 4 to add, 9 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*